config.org
#+TITLE: SiM's Doom Emacs Config
#+AUTHOR: Siegmar Mantei
#+DESCRIPTION: SiM's personal Doom Emacs config.
#+STARTUP: showeverything

* ABOUT THIS CONFIG
This is my personal Doom Emacs config. Doom Emacs is a distribution of Emacs that offers the "evil" keybindings (Vim keybindings) and the standard keybindings. And Doom includes a number of nice extensions and a bit of configuration out of the box. The Vim keybindings are made for US keyboard layout. I use a german layout [[https://neo-layout.org/][Neo2]]. Therefore I use the standard keybindings plus xah fly keys and customized it for Neo2.

(The [[https://gitlab.com/dwt1/dotfiles/-/tree/master/.config/doom][config]] from Distro Tube, D. Taylor inspired me. So I refactored my config.)

* Shell User
From doom documentation .emacs.d/lisp/cli/doctor.el:

Fish (and possibly other non-POSIX shells) is known to inject garbage
output into some of the child processes that Emacs spawns. Many Emacs
packages/utilities will choke on this output, causing unpredictable issues.

To get around this, either:
- Add the following to $DOOMDIR/config.el:
  =(setq! shell-file-name (executable-find "bash"))=
- Or change your default shell to a POSIX shell (like bash or zsh)
  and explicitly configure your terminal apps to use the shell you
  want.

If you opt for option 1 and use one of Emacs' terminal emulators, you
will also need to configure them to use Fish, e.g.
=(setq-default vterm-shell (executable-find "fish"))=
=(setq-default explicit-shell-file-name (executable-find "fish"))=
#+begin_src emacs-lisp
(setq! shell-file-name (executable-find "bash" ))
(setq-default vterm-shell (executable-find "zsh" ))
(setq-default explicit-shell-file-name (executable-find "zsh" ))
#+end_src


* Bookmarks
Settings for Bookmark are stored in this folder
/Users/sim/.config/emacs/.local/etc


#+begin_comment
(use-package eshell-bookmark
  :ensure t
  :after eshell
  :hook (eshell-mode . eshell-bookmark-setup))
#+end_comment


* Four modifier
Using four modifier in emacs is possible if you are using right and left super  or control key to provide meta, control, hyper and super modifier keys. You can use [[https://karabiner-elements.pqrs.org/][Karabiner-Elements]] a stable keyboard customizer for macOS.

And it is also a basic modifier setup, that works well for me.

[[https://github.com/sieman/four-modifier][Github Sieman Four Modifier]]
#+begin_src emacs-lisp :tangle "packages.el"
(package! four-modifier :recipe (:host github :repo "sieman/four-modifier"))
#+end_src

#+begin_src emacs-lisp
(require 'four-modifier)
#+end_src

* Xah Fly Keys
I like to use a modal editing mode like vim but the fly keys keybinding system is more ergonmic and can be used on diffrent keyboard layouts.

https://github.com/xahlee/xah-fly-keys
http://xahlee.info/emacs/misc/xah-fly-keys.html

#+begin_src emacs-lisp :tangle "packages.el"
(package! xah-fly-keys :recipe (:host github :repo "xahlee/xah-fly-keys"))
(package! neo-layout-fly-keys :recipe (:host github :repo "sieman/neo-layout-fly-keys"))
#+end_src


[[https://github.com/sieman/neo-layout-fly-keys][Neo Layout Fly Keys]]
The advantage of Fly Keys that this package works with diffrent keybord layouts. And this is the adaption for Neo2 layout.

#+begin_src emacs-lisp
(after! xah-fly-keys
  (defun sim/flykeys-indicate-command-mode () (interactive)
         (custom-set-faces
          `(cursor ((t (:background "SeaGreen4"))))
          ;; `(cursor ((t (:background "#1ea4ff"))))
          ;; `(dirvish-hl-line ((t (:box (:line-width 2 :color "white")))))
          )
         (custom-set-variables '(cursor-type 'box))
         (blink-cursor-mode 1)
         (xah-fly-save-buffer-if-file)
         )

  (defun sim/flykeys-indicate-insert-mode () (interactive)
         (custom-set-faces
          `(cursor ((t (:background "red"))))
          )
         (custom-set-variables '(cursor-type 'hollow))
         (blink-cursor-mode 0)
         (better-jumper-set-jump))

  (add-hook! 'xah-fly-insert-mode-activate-hook  'sim/flykeys-indicate-insert-mode)
  (add-hook! 'xah-fly-command-mode-activate-hook 'sim/flykeys-indicate-command-mode)

  (add-hook! '(color-rg-mode-hook
               dired-hook
               dirvish-setup-hook
               dirvish-mode-hook
               consult--filter-find-file-hook
               eshell-mode-hook
               magit-mode-hook
               magit-popup-mode-hook
               pdf-view-mode
               pdf-view-mode-hook
               transient-mark-mode-hook
               transient-setup-buffer-hook)
             #'xah-fly-insert-mode-activate)
  ;; (global-set-key (kbd "H-<left>") 'xah-fly-command-mode-activate)
  ;; (global-set-key (kbd "ESC ESC") 'xah-fly-command-mode-activate)
  )


(defun sim/flykeys-on ()
  (interactive)
  (neo2/flykeys-on)
  (define-key xah-fly-command-map (kbd "1") nil)
  (define-key xah-fly-command-map (kbd "1") 'delete-other-windows)

  (define-key xah-fly-command-map (kbd "2") nil)
  (define-key xah-fly-command-map (kbd "2") 'sim/split-window-below-and-move-there-dammit)
  (define-key xah-fly-command-map (kbd "3") nil)
  (define-key xah-fly-command-map (kbd "3") 'sim/split-window-right-and-move-there-dammit)
  (define-key xah-fly-command-map (kbd "4") nil)
  (define-key xah-fly-command-map (kbd "4") 'delete-window)

  (define-key xah-fly-command-map (kbd "5") nil)
  (define-key xah-fly-command-map (kbd "5") (kbd! "C-c l"))
  ;;(define-key xah-fly-command-map (kbd "TAB") xah-fly--tab-key-map)

  (define-key xah-fly-command-map (kbd "8") nil)
  (define-key xah-fly-command-map (kbd "8") 'xah-select-text-in-quote)
  (define-key xah-fly-command-map (kbd "9") nil)
  (define-key xah-fly-command-map (kbd "9") 'xah-extend-selection)
  (define-key xah-fly-command-map (kbd "q") nil)
  (define-key xah-fly-command-map (kbd "q") 'exchange-point-and-mark)

  (define-key xah-fly-command-map (kbd "U") 'eval-expression)

  (define-key xah-fly-command-map (kbd "o") nil)
  (define-key xah-fly-command-map (kbd "o") (kbd! "C-c"))

  (define-key xah-fly-command-map (kbd "O") nil)
  (define-key xah-fly-command-map (kbd "O") (kbd! "C-x"))

  (define-key xah-fly-command-map (kbd "s") (kbd! "C-c l"))
  (define-key xah-fly-command-map (kbd "b") 'avy-goto-char-2)
  (define-key xah-fly-command-map (kbd "A") 'casual-avy-tmenu)
  (define-key xah-fly-command-map (kbd "I") 'casual-isearch-tmenu)

  (define-key xah-fly-command-map (kbd "-") 'org-next-visible-heading)
  (define-key xah-fly-command-map (kbd "J") 'other-frame)
  (define-key xah-fly-command-map (kbd "(") 'org-previous-visible-heading)

  (define-key xah-fly-command-map (kbd "d") nil)
  (define-key xah-fly-command-map (kbd ")") 'repeat)
  (define-key xah-fly-command-map (kbd "d") 'xah-goto-matching-bracket)

  (define-key xah-fly-command-map (kbd "m") nil)

  (define-key xah-fly-command-map (kbd ",") nil)
  (define-key xah-fly-command-map (kbd ",") 'open-line)
  (define-key xah-fly-command-map (kbd "–") nil)
  (define-key xah-fly-command-map (kbd "–") 'xah-shrink-whitespaces)

  (define-key xah-fly-command-map (kbd ".") nil)
  (define-key xah-fly-command-map (kbd ".") (kbd! "<f7>"))

  (define-key xah-fly-command-map (kbd "j") nil)
  (define-key xah-fly-command-map (kbd "j") 'xah-next-window-or-frame)

  (define-key xah-fly-command-map (kbd "SPC") nil)
  (define-key xah-fly-command-map (kbd "SPC") 'xah-insert-space-before)

  ;;Wrong type argument: commandp, (neo2/insert-mode-f 'casual-avy-tmenu)
  ;; (defun neo2/insert-mode-f (func)
  ;;   "Go to insert mode and execute giffen func function."
  ;;   (interactive)
  ;;   (xah-fly-insert-mode-activate)
  ;;   (funcall func))
  )
#+End_src


* Dired
** dired - file manager
#+begin_src emacs-lisp
(after! dired
  (add-hook 'dired-mode-hook
            (lambda ()
              (dired-hide-details-mode 1)
              (map!
               :mode 'dired-mode
               :desc "Hides dotfiles DIRED" "C-c t ." #'dired-hide-dotfiles-mode))
            )
  (put 'dired-find-alternate-file 'disabled nil)
  )
#+end_src

** Hide Dot file
Most of the time I'm not interested to see all dotfiles. This package hides the dotfiles.
https://github.com/mattiasb/dired-hide-dotfiles
#+begin_src emacs-lisp :tangle "packages.el"
(package! dired-hide-dotfiles :recipe (:host github :repo "mattiasb/dired-hide-dotfiles"))
#+end_src
** DirVish
https://github.com/alexluigit/dirvish?tab=readme-ov-file
https://github.com/alexluigit/dirvish/blob/main/docs/EMACS-NEWCOMERS.org

#+begin_src emacs-lisp
(after! dirvish
  (setq! dirvish-quick-access-entries
         `(
           ("c" "~/Documents/Code/" "Code")
           ("d" "~/Desktop/" "Desktop")
           ("e" ,"~/.config/" "Config Folder")
           ("f" ,"~/.config/emacs/.local/etc/" "Emacs local")
           ("k" "~/Documents/EinnahmenAusgaben/Kontoauszuege" "Kontoauszuege")
           ("l" "~/Downloads/" "Downloads")
           ("o" "~/Documents/" "Documents")
           ("p" "~/Pictures/"  "Pictures")
           ("r" "~/Documents/orgs/" "Org Files")
           ("s" "~/Documents/EinnahmenAusgaben/Steuer" "Steuer")
           ("h" "~/" "Home")
           ;; ("" "~/" "")
           )
         )
  (map! :map dired-mode-map
        "ß" #'dired-omit-mode
        "ü" #'dirvish-mode-map
        "ä" #'dirvish-quick-access)
  ;; (setq! dirvish-hide-details t)
  (setq! dirvish-preview-dired-sync-omit t)
  )
#+end_src


* Elisp Bug Hunter :language:
I think that is useful to find bugs in elisp. I have to expore that package!

https://github.com/Malabarba/elisp-bug-hunter
#+begin_src emacs-lisp :tangle "packages.el"
(package! elisp-bug-hunter :recipe (:host github :repo "Malabarba/elisp-bug-hunter"))
#+end_src

* Theme :appearance:
[[https://github.com/doomemacs/themes][Doom Emacs' Theme Pack]]
Solarized improved version is oksolar :-)
#+begin_src emacs-lisp
;; load this theme at startup
;; (setq! doom-theme 'doom-one)
;; (setq! doom-theme 'doom-oksolar-dark)
;; (setq! doom-theme 'doom-oksolar-light)
(setq! doom-theme 'doom-earl-grey)
;; (setq! doom-theme 'modus-operandi-tritanopia)
;; All themes are safe to load
(setq! custom-safe-themes t)
#+end_src

* TODO I like to check the [[https://github.com/ronisbr/doom-nano-modeline][nano]] port for doom.

* Appearance Cursor Parentheses Region :appearance:
#+begin_src emacs-lisp
(custom-set-faces
 '(show-paren-match ((t (:background "black" :foreground "yellow" :inverse-video t :weight bold))))
 '(region ((t (:foreground "#f1c40f" :background "#2c3e50" :inverse-video t))))
 `(cursor ((t (:foreground "white" :background "red")))))

(custom-set-variables '(cursor-type 'box))
#+end_src
* Dashboard and Splash Image :appearance:
#+begin_src emacs-lisp
;; Splash image
(setq! fancy-splash-image (concat doom-private-dir "thenwhyworry.png")
      +doom-dashboard-banner-padding '(0 . 1))
;; Hide the menu for as minimalistic a startup screen as possible.
(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
#+end_src
* Projectile

Your $HOME is recognized as a project root! Emacs will assume $HOME is the root of any project living under $HOME. If this
isn't desired, you will need to remove ".git" from `projectile-project-root-files-bottom-up' (a variable)

#+begin_src emacs-lisp
(after! projectile
  (setq! projectile-project-root-files-bottom-up (remove ".git" projectile-project-root-files-bottom-up)))
#+end_src

