config.org
* Keyboard Macros
This Section defines some Macros for reuse.

#+begin_src emacs-lisp  :tangle +superkeys.el
(defalias 'sim/org-h3-date
  (kmacro "r * * * SPC C-c . <return> <left> S-<up> <right> SPC"))
#+end_src

* Last Action

#+begin_src emacs-lisp
;; (after! doom-modeline
;; (global-hide-mode-line-mode))
(load! "+superkeys.el")
(sim/flykeys-on)
(display-time-mode t)
(load! "emacs.secrets.el")
#+end_src


This is not loaded!

#+begin_src emacs-lisp :tangle no
;; (after! ox
;;   (load! "ox-koma-letter"))

;; (after! ox-koma-letter
;;   '(progn
;;      (setq! org-koma-letter-default-class "brief")))
(load! "/Users/sim/.emacs.secrets.el")
#+end_src
