+superkeys.el

(defalias 'sim/org-h3-date
  (kmacro "r * * * SPC C-c . <return> <left> S-<up> <right> SPC"))
